Pandas Merge, Join, Concat examples documentation

https://pandas.pydata.org/docs/user_guide/merging.html

## Tree main functions to combine datasets

* Merge

* Join 

* Concatenate

## Different ways to join/merge datasets


left            
        
- Use keys from left frame only

right
		
- Use keys from right frame only


inner


- Use intersection of keys from both frames


outer
	
- Use union of keys from both frames

cross

- combine every row with every other row

## MERGE

In [1]:
import pandas as pd

In [2]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [3]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [4]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [5]:
pd.merge(left_df, right_df, on='key', indicator=True)  # detta Ã¤r en, by default, inner join

  key   A   B   C   D _merge
0  K1  A1  B1  C1  D1   both
1  K2  A2  B2  C2  D2   both
2  K3  A3  B3  C3  D3   both
3  K4  A4  B4  C4  D4   both

notera skillnaden i ordningen och hur resultatet ser ut

In [6]:
pd.merge(right_df, left_df, on='key')

  key   C   D   A   B
0  K1  C1  D1  A1  B1
1  K2  C2  D2  A2  B2
2  K3  C3  D3  A3  B3
3  K4  C4  D4  A4  B4

**inner**

Notera ett inner Ã¤r default

In [7]:
pd.merge(left_df, right_df, on='key', how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

**left**

In [8]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [9]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [10]:
pd.merge(left_df, right_df, on='key', how='left', indicator=True)

  key   A   B    C    D     _merge
0  K0  A0  B0  NaN  NaN  left_only
1  K1  A1  B1   C1   D1       both
2  K2  A2  B2   C2   D2       both
3  K3  A3  B3   C3   D3       both
4  K4  A4  B4   C4   D4       both

In [11]:
pd.merge(right_df, left_df, on='key', how='left')

  key   C   D    A    B
0  K1  C1  D1   A1   B1
1  K2  C2  D2   A2   B2
2  K3  C3  D3   A3   B3
3  K4  C4  D4   A4   B4
4  K5  C5  D5  NaN  NaN

**right**

In [12]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [13]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [14]:
pd.merge(left_df, right_df, on='key', how='right')

  key    A    B   C   D
0  K1   A1   B1  C1  D1
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K4   A4   B4  C4  D4
4  K5  NaN  NaN  C5  D5

**outer**

In [15]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [16]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [17]:
pd.merge(left_df, right_df, on='key', how='outer')

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4   A4   B4   C4   D4
5  K5  NaN  NaN   C5   D5

**cross**

In [18]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'X': ['a', 'b'], 'Y': ['c', 'd']}
df2 = pd.DataFrame(data2)

In [19]:
df1

   A  B
0  1  3
1  2  4

In [20]:
df2

   X  Y
0  a  c
1  b  d

In [21]:
pd.merge(df1, df2, how='cross')

   A  B  X  Y
0  1  3  a  c
1  1  3  b  d
2  2  4  a  c
3  2  4  b  d

In [22]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'X': ['a', 'b','c'], 'Y': ['d', 'e', 'f']}
df2 = pd.DataFrame(data2)

In [23]:
df1

   A  B
0  1  3
1  2  4

In [24]:
df2

   X  Y
0  a  d
1  b  e
2  c  f

In [25]:
pd.merge(df1, df2, how='cross')

   A  B  X  Y
0  1  3  a  d
1  1  3  b  e
2  1  3  c  f
3  2  4  a  d
4  2  4  b  e
5  2  4  c  f

In [26]:
df1

   A  B
0  1  3
1  2  4

In [27]:
df2

   X  Y
0  a  d
1  b  e
2  c  f

In [28]:
pd.merge(df2, df1, how='cross')

   X  Y  A  B
0  a  d  1  3
1  a  d  2  4
2  b  e  1  3
3  b  e  2  4
4  c  f  1  3
5  c  f  2  4

In [ ]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'A': ['a', 'b'], 'Y': ['c', 'd']}
df2 = pd.DataFrame(data2)

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2, how='cross', suffixes=['_left', '_right'])

## Duplicerade nycklar

In [ ]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K4", "K3", "K1", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [ ]:
left_df

In [ ]:
right_df

In [ ]:
pd.merge(left_df, right_df, on='key', how='left')

**Att inte ange kolumn att merge pÃ¥ (bad practice)**

In [ ]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [ ]:
left_df

In [ ]:
right_df

In [ ]:
pd.merge(left_df, right_df, how='inner')

**FÃ¶rÃ¶ka merge pÃ¥ icke gemensam kolumn**

In [ ]:
pd.merge(left_df, right_df, on='A', how='inner')

**Att merga pÃ¥ flera kolumner samtidigt**

In [ ]:
left_df = pd.DataFrame(

    {

        "key1": ["K0", "K0", "K1", "K2"],

        "key2": ["K0", "K1", "K0", "K1"],

        "A": ["A0", "A1", "A2", "A3"],

        "B": ["B0", "B1", "B2", "B3"],

    }

)



right_df = pd.DataFrame(

    {

        "key1": ["K0", "K1", "K1", "K2"],

        "key2": ["K0", "K0", "K0", "K0"],

        "C": ["C0", "C1", "C2", "C3"],

        "D": ["D0", "D1", "D2", "D3"],

    }

)

In [ ]:
left_df

In [ ]:
right_df

In [ ]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='right')

In [ ]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='left')

In [ ]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='inner')

**ett ekvivalent sÃ¤tt att merga pÃ¥**

In [ ]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [ ]:
left_df

In [ ]:
right_df

In [ ]:
left_df.merge(right_df, on='key', how='inner')

In [ ]:
pd.merge(left_df, right_df, on='key', how='inner')

**att merga pÃ¥ kolumner som inte heter samma sak**

In [ ]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "nyckel": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [ ]:
left_df

In [ ]:
right_df

In [ ]:
pd.merge(left_df, right_df, left_on='key', right_on='nyckel')

# Join

In [30]:
left_df = pd.DataFrame(

    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]

)



right_df = pd.DataFrame(

    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]

)

In [31]:
left_df

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [32]:
right_df

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [36]:
left_df.join(right_df)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [37]:
left_df.join(right_df, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [38]:
left_df.join(right_df, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [39]:
left_df.join(right_df, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [40]:
left_df.join(right_df, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

**Concatenate**

In [41]:
df1 = pd.DataFrame(

    {

        "A": ["A0", "A1", "A2", "A3"],

        "B": ["B0", "B1", "B2", "B3"],

        "C": ["C0", "C1", "C2", "C3"],

        "D": ["D0", "D1", "D2", "D3"],

    },

    index=[0, 1, 2, 3],

)



df2 = pd.DataFrame(

    {

        "A": ["A4", "A5", "A6", "A7"],

        "B": ["B4", "B5", "B6", "B7"],

        "C": ["C4", "C5", "C6", "C7"],

        "D": ["D4", "D5", "D6", "D7"],

    },

    index=[4, 5, 6, 7],

)



df3 = pd.DataFrame(

    {

        "A": ["A8", "A9", "A10", "A11"],

        "B": ["B8", "B9", "B10", "B11"],

        "C": ["C8", "C9", "C10", "C11"],

        "D": ["D8", "D9", "D10", "D11"],

    },

    index=[8, 9, 10, 11],

)

In [42]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [43]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [44]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [47]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [51]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [52]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [50]:
pd.concat([df1, df2], axis='columns')

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [53]:
df1 = pd.DataFrame(

    {

        "A": ["A0", "A1", "A2", "A3"],

        "B": ["B0", "B1", "B2", "B3"],

        "C": ["C0", "C1", "C2", "C3"],

        "D": ["D0", "D1", "D2", "D3"],

    },

    index=[0, 1, 2, 3],

)



df2 = pd.DataFrame(

    {

        "A": ["A4", "A5", "A6", "A7"],

        "B": ["B4", "B5", "B6", "B7"],

        "C": ["C4", "C5", "C6", "C7"],

        "D": ["D4", "D5", "D6", "D7"],

    },

    index=[0, 1, 2, 3],

)

In [54]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [55]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [61]:
result = pd.concat([df1, df2], axis='columns')

result['A']

    A   A
0  A0  A4
1  A1  A5
2  A2  A6
3  A3  A7

In [62]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [63]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [65]:
df1.join(df2, rsuffix='_r', lsuffix='_l')

  A_l B_l C_l D_l A_r B_r C_r D_r
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [66]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [67]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [70]:
pd.concat([df1, df2]).reset_index(drop=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

## SCRAPE WIKIPEDIA YE

## probably need to:

**conda install lxml**

IN YOUR ENVIRONMENT!!!!

In [86]:
swedish_demo = pd.read_html('https://sv.wikipedia.org/wiki/Sveriges_demografi')

len(swedish_demo)

21

In [87]:
isinstance(swedish_demo, list)

True

In [88]:
swedish_demo[1]

                                   Vid utgÃ¥ngen av Ã¥r  \
                                   Vid utgÃ¥ngen av Ã¥r
0                                                1570
1                                                1650
2                                                1700
3                                                1720
4                                                1755
5                                                1815
6                                                1865
7                                                1900
8                                                2000
9                                                2020
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

                                            FolkmÃ¤ngd  \
                                            FolkmÃ¤ngd
0                                             900Â 000
1                                           1Â 225Â 000
2                                           1Â 485Â 000
3                                           1Â 350Â 000
4                                           1Â 878Â 000
5                                           2Â 465Â 000
6                                           4Â 099Â 000
7                                           5Â 140Â 000
8                                           8Â 861Â 000
9                                          10Â 379Â 000
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

                                       Ãrlig tillvÃ¤xt  \
                                               Totalt
0                                                   â
1                                               4Â 063
2                                               5Â 200
3                                              â6Â 750
4                                              15Â 086
5                                               9Â 783
6                                              32Â 680
7                                              29Â 743
8                                                 NaN
9                                                 NaN
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...


                                             Promille
0                                                   â
1                                                 386
2                                                 386
3                                               â4,75
4                                                 948
5                                                 454
6                                                1022
7                                                 648
8                                                 NaN
9                                                 NaN
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

In [92]:
swedish_demo[1]['Ãrlig tillvÃ¤xt']['Promille']

0                                                     â
1                                                   386
2                                                   386
3                                                 â4,75
4                                                   948
5                                                   454
6                                                  1022
7                                                   648
8                                                   NaN
9                                                   NaN
10    Datan avser folkmÃ¤ngden inom Sveriges nuvarand...
Name: Promille, dtype: object

In [93]:
min_df = swedish_demo[1]

In [94]:
min_df

                                   Vid utgÃ¥ngen av Ã¥r  \
                                   Vid utgÃ¥ngen av Ã¥r
0                                                1570
1                                                1650
2                                                1700
3                                                1720
4                                                1755
5                                                1815
6                                                1865
7                                                1900
8                                                2000
9                                                2020
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

                                            FolkmÃ¤ngd  \
                                            FolkmÃ¤ngd
0                                             900Â 000
1                                           1Â 225Â 000
2                                           1Â 485Â 000
3                                           1Â 350Â 000
4                                           1Â 878Â 000
5                                           2Â 465Â 000
6                                           4Â 099Â 000
7                                           5Â 140Â 000
8                                           8Â 861Â 000
9                                          10Â 379Â 000
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

                                       Ãrlig tillvÃ¤xt  \
                                               Totalt
0                                                   â
1                                               4Â 063
2                                               5Â 200
3                                              â6Â 750
4                                              15Â 086
5                                               9Â 783
6                                              32Â 680
7                                              29Â 743
8                                                 NaN
9                                                 NaN
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...


                                             Promille
0                                                   â
1                                                 386
2                                                 386
3                                               â4,75
4                                                 948
5                                                 454
6                                                1022
7                                                 648
8                                                 NaN
9                                                 NaN
10  Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

In [83]:
swedish_demo[1].columns = swedish_demo[1].columns.droplevel(level=0)

In [84]:
swedish_demo[1]

,Vid utgÃ¥ngen av Ã¥r,FolkmÃ¤ngd,Totalt,Promille
0,1570,900Â 000,â,â
1,1650,1Â 225Â 000,4Â 063,386
2,1700,1Â 485Â 000,5Â 200,386
3,1720,1Â 350Â 000,â6Â 750,"â4,75"
4,1755,1Â 878Â 000,15Â 086,948
5,1815,2Â 465Â 000,9Â 783,454
6,1865,4Â 099Â 000,32Â 680,1022
7,1900,5Â 140Â 000,29Â 743,648
8,2000,8Â 861Â 000,NaN,NaN
9,2020,10Â 379Â 000,NaN,NaN
10,Datan avser folkmÃ¤ngden inom Sveriges nuvarand...,Datan avser folkmÃ¤ngden inom Sveriges nuvarand...,Datan avser folkmÃ¤ngden inom Sveriges nuvarand...,Datan avser folkmÃ¤ngden inom Sveriges nuvarand...

In [79]:
swedish_demo[1].columns.droplevel(level=0)

Index(['Vid utgÃ¥ngen av Ã¥r', 'FolkmÃ¤ngd', 'Totalt', 'Promille'], dtype='object')